collin80/ESP32RET/SerialConsole.cpp
/*
LAWICEL single letter commands are now mixed in with the other commands here.
*/
void SerialConsole::handleShortCmd()
{
    uint8_t val;

    switch (cmdBuffer[0]) {
    //non-lawicel commands
    case 'h':
    case '?':
    case 'H':
        printMenu();
        break;
    case 'R': //reset to factory defaults.
        settings.version = 0xFF;
        EEPROM.writeBytes(0, &settings, sizeof(settings));
        Logger::console("Power cycle to reset to factory defaults");
        break;
    case 's': //start logging canbus to file
        Logger::console("Starting logging to file.");
        SysSettings.logToFile = true;
        break;
    case 'S': //stop logging canbus to file
        Logger::console("Ceasing file logging.");
        SysSettings.logToFile = false;
        break;
        
    //Lawicel specific commands    
    case 'O': //LAWICEL open canbus port (first one only because LAWICEL has no concept of dual canbus
        CAN0.setListenOnlyMode(false);
        CAN0.begin(settings.CAN0Speed, 255);
        CAN0.enable();
        Serial.write(13); //send CR to mean "ok"
        SysSettings.lawicelMode = true;
        break;
    case 'C': //LAWICEL close canbus port (First one)
        CAN0.disable();
        Serial.write(13); //send CR to mean "ok"
        break;
    case 'L': //LAWICEL open canbus port in listen only mode
        CAN0.setListenOnlyMode(true);
        CAN0.begin(settings.CAN0Speed, 255);        
        CAN0.enable();
        Serial.write(13); //send CR to mean "ok"
        SysSettings.lawicelMode = true;
        break;
    case 'P': //LAWICEL - poll for one waiting frame. Or, just CR if no frames
        if (CAN0.available()) SysSettings.lawicelPollCounter = 1;
        else Serial.write(13); //no waiting frames
        break;
    case 'A': //LAWICEL - poll for all waiting frames - CR if no frames
        SysSettings.lawicelPollCounter = CAN0.available();
        if (SysSettings.lawicelPollCounter == 0) Serial.write(13);
        break;
    case 'F': //LAWICEL - read status bits
        Serial.print("F00"); //bit 0 = RX Fifo Full, 1 = TX Fifo Full, 2 = Error warning, 3 = Data overrun, 5= Error passive, 6 = Arb. Lost, 7 = Bus Error
        Serial.write(13);
        break;
    case 'V': //LAWICEL - get version number
        Serial.print("V1013\n");
        SysSettings.lawicelMode = true;
        break;
    case 'N': //LAWICEL - get serial number
        Serial.print("ESP32RET\n");
        SysSettings.lawicelMode = true;
        break;
    case 'x':
        SysSettings.lawicellExtendedMode = !SysSettings.lawicellExtendedMode;
        if (SysSettings.lawicellExtendedMode) {
            Serial.print("V2\n");
        }
        else {
            Serial.print("LAWICEL\n");
        }            
        break;
    case 'B': //LAWICEL V2 - Output list of supported buses
        if (SysSettings.lawicellExtendedMode) {
            for (int i = 0; i < NUM_BUSES; i++) {
                printBusName(i);
                Serial.print("\n");
            }
        }
        break;
    case 'X':
        if (SysSettings.lawicellExtendedMode) {
        }
        break;        
    }
}

void SerialConsole::handleLawicelCmd()
{
    cmdBuffer[ptrBuffer] = 0; //make sure to null terminate
    CAN_FRAME outFrame;
    char buff[80];
    int val;
    
    tokenizeCmdString();

    switch (cmdBuffer[0]) {
    case 't': //transmit standard frame
        outFrame.id = parseHexString(cmdBuffer + 1, 3);
        outFrame.length = cmdBuffer[4] - '0';
        outFrame.extended = false;
        if (outFrame.length < 0) outFrame.length = 0;
        if (outFrame.length > 8) outFrame.length = 8;
        for (int data = 0; data < outFrame.length; data++) {
            outFrame.data.bytes[data] = parseHexString(cmdBuffer + 5 + (2 * data), 2);
        }
        CAN0.sendFrame(outFrame);
        if (SysSettings.lawicelAutoPoll) Serial.print("z");
        break;
    case 'T': //transmit extended frame
        outFrame.id = parseHexString(cmdBuffer + 1, 8);
        outFrame.length = cmdBuffer[9] - '0';
        outFrame.extended = false;
        if (outFrame.length < 0) outFrame.length = 0;
        if (outFrame.length > 8) outFrame.length = 8;
        for (int data = 0; data < outFrame.length; data++) {
            outFrame.data.bytes[data] = parseHexString(cmdBuffer + 10 + (2 * data), 2);
        }
        CAN0.sendFrame(outFrame);
        if (SysSettings.lawicelAutoPoll) Serial.print("Z");
        break;
    case 'S': 
        if (!SysSettings.lawicellExtendedMode) {
            //setup canbus baud via predefined speeds
            val = parseHexCharacter(cmdBuffer[1]);
            switch (val) {
            case 0:
                settings.CAN0Speed = 10000;
                break;
            case 1:
                settings.CAN0Speed = 20000;
                break;
            case 2:
                settings.CAN0Speed = 50000;
                break;
            case 3:
                settings.CAN0Speed = 100000;
                break;
            case 4:
                settings.CAN0Speed = 125000;
                break;
            case 5:
                settings.CAN0Speed = 250000;
                break;
            case 6:
                settings.CAN0Speed = 500000;
                break;
            case 7:
                settings.CAN0Speed = 800000;
                break;
            case 8:
                settings.CAN0Speed = 1000000;
                break;
            }
        }
        else { //LAWICEL V2 - Send packet out of specified bus - S <Bus> <ID> <Data0> <Data1> <...>
            uint8_t bytes[8];
            uint32_t id;
            int numBytes = 0;
            id = strtol(tokens[2], nullptr, 16);
            for (int b = 0; b < 8; b++) {
                if (tokens[3 + b][0] != 0) {
                    bytes[b] = strtol(tokens[3 + b], nullptr, 16);
                    numBytes++;
                }
                else break; //break for loop because we're obviously done.
            }
            if (!strcasecmp(tokens[1], "CAN0")) {
                CAN_FRAME outFrame;
                outFrame.id = id;
                outFrame.length = numBytes;
                outFrame.extended = false;
                for (int b = 0; b < numBytes; b++) outFrame.data.bytes[b] = bytes[b];
                CAN0.sendFrame(outFrame);
            }
            if (!strcasecmp(tokens[1], "CAN1")) {
                CAN_FRAME outFrame;
                outFrame.id = id;
                outFrame.length = numBytes;
                outFrame.extended = false;
                for (int b = 0; b < numBytes; b++) outFrame.data.bytes[b] = bytes[b];
                CAN1.sendFrame(outFrame);                
            }
        }
    case 's': //setup canbus baud via register writes (we can't really do that...)
        //settings.CAN0Speed = 250000;
        break;
    case 'r': //send a standard RTR frame (don't really... that's so deprecated its not even funny)
        break;
    case 'R': 
        if (SysSettings.lawicellExtendedMode) { //Lawicel V2 - Set that we want to receive traffic from the given bus - R <BUSID>
            if (!strcasecmp(tokens[1], "CAN0")) SysSettings.lawicelBusReception[0] = true;
            if (!strcasecmp(tokens[1], "CAN1")) SysSettings.lawicelBusReception[1] = true; 
        }
        else { //Lawicel V1 - send extended RTR frame (NO! DON'T DO IT!)
        }
        break;
    case 'X': //Set autopoll off/on
        if (cmdBuffer[1] == '1') SysSettings.lawicelAutoPoll = true;
        else SysSettings.lawicelAutoPoll = false;
        break;
    case 'W': //Dual or single filter mode
        break; //don't actually support this mode
    case 'm': //set acceptance mask - these things seem to be odd and aren't actually implemented yet
    case 'M': 
        if (SysSettings.lawicellExtendedMode) { //Lawicel V2 - Set filter mask - M <busid> <Mask> <FilterID> <Ext?>
            int mask = strtol(tokens[2], nullptr, 16);
            int filt = strtol(tokens[3], nullptr, 16);
            if (!strcasecmp(tokens[1], "CAN0")) {
                if (!strcasecmp(tokens[4], "X")) CAN0.setRXFilter(0, filt, mask, true);
                    else CAN0.setRXFilter(0, filt, mask, false);
            }           
            if (!strcasecmp(tokens[1], "CAN1")) {
                if (!strcasecmp(tokens[4], "X")) CAN1.setRXFilter(0, filt, mask, true);
                    else CAN1.setRXFilter(0, filt, mask, false);                
            }
        }
        else { //Lawicel V1 - set acceptance code
        }        
        break;
    case 'H':
        if (SysSettings.lawicellExtendedMode) { //Lawicel V2 - Halt reception of traffic from given bus - H <busid>
            if (!strcasecmp(tokens[1], "CAN0")) SysSettings.lawicelBusReception[0] = false;
            if (!strcasecmp(tokens[1], "CAN1")) SysSettings.lawicelBusReception[1] = false; 
        } 
        break;        
    case 'U': //set uart speed. We just ignore this. You can't set a baud rate on a USB CDC port
        break; //also no action here
    case 'Z': //Turn timestamp off/on
        if (cmdBuffer[1] == '1') SysSettings.lawicelTimestamping = true;
        else SysSettings.lawicelTimestamping =  false;
        break;
    case 'Q': //turn auto start up on/off - probably don't need to actually implement this at the moment.
        break; //no action yet or maybe ever
    case 'C': //Lawicel V2 - configure one of the buses - C <busid> <speed> <any additional needed params> 
        if (SysSettings.lawicellExtendedMode) {
            //at least two parameters separated by spaces. First BUS ID (CAN0, CAN1, SWCAN, etc) then speed (or more params separated by #'s)
            int speed = atoi(tokens[2]);
            if (!strcasecmp(tokens[1], "CAN0")) {
                CAN0.begin(speed, 255);
            }           
            if (!strcasecmp(tokens[1], "CAN1")) {
                CAN1.begin(speed, 255);
            }
        }
        break;
    }
    Serial.write(13);
}

void SerialConsole::handleConfigCmd()
{
    int i;
    int newValue;
    char *newString;
    bool writeEEPROM = false;
    bool writeDigEE = false;
    char *dataTok;

    //Logger::debug("Cmd size: %i", ptrBuffer);
    if (ptrBuffer < 6)
        return; //4 digit command, =, value is at least 6 characters
    cmdBuffer[ptrBuffer] = 0; //make sure to null terminate
    String cmdString = String();
    unsigned char whichEntry = '0';
    i = 0;

    while (cmdBuffer[i] != '=' && i < ptrBuffer) {
        cmdString.concat(String(cmdBuffer[i++]));
    }
    i++; //skip the =
    if (i >= ptrBuffer) {
        Logger::console("Command needs a value..ie TORQ=3000");
        Logger::console("");
        return; //or, we could use this to display the parameter instead of setting
    }

